## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/5819945944)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 2 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * module.github_webhook_gateway.google_secret_manager_secret_iam_member.gh_tools_kyma_bot_token_accessor
  * module.github_webhook_gateway.google_secret_manager_secret_iam_member.webhook_token_accessor
* Update
  * module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry
  * module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway
* Delete
  * module.github_webhook_gateway.google_secret_manager_secret_iam_member.gh_issue_finder_gh_tools_kyma_bot_token_accessor



<details><summary>Change Result (Click me)</summary>

```hcl

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact_registry" {
        id            = "projects/sap-kyma-prow/locations/europe/repositories/modules-internal"
        name          = "modules-internal"
        # (9 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway will be updated in-place
  ~ resource "google_cloud_run_service" "github_webhook_gateway" {
        id                         = "locations/europe-west3/namespaces/sap-kyma-prow/services/github-webhook-gateway"
        name                       = "github-webhook-gateway"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                    # (3 unchanged attributes hidden)

                  + env {
                      + name  = "WEBHOOK_TOKEN_PATH"
                      + value = "/etc/webhook-token/sap-tools-github-backlog-webhook-secret"
                    }

                  + volume_mounts {
                      + mount_path = "/etc/webhook-token"
                      + name       = "webhook-token"
                    }

                    # (10 unchanged blocks hidden)
                }

              + volumes {
                  + name = "webhook-token"

                  + secret {
                      + secret_name = "sap-tools-github-backlog-webhook-secret"
                    }
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.github_webhook_gateway.google_secret_manager_secret_iam_member.gh_issue_finder_gh_tools_kyma_bot_token_accessor will be destroyed
  # (because google_secret_manager_secret_iam_member.gh_issue_finder_gh_tools_kyma_bot_token_accessor is not in configuration)
  - resource "google_secret_manager_secret_iam_member" "gh_issue_finder_gh_tools_kyma_bot_token_accessor" {
      - etag      = "BwYCZ3y3EdI=" -> null
      - id        = "projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com" -> null
      - member    = "serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com" -> null
      - project   = "sap-kyma-prow" -> null
      - role      = "roles/secretmanager.secretAccessor" -> null
      - secret_id = "projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token" -> null
    }

  # module.github_webhook_gateway.google_secret_manager_secret_iam_member.gh_tools_kyma_bot_token_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "gh_tools_kyma_bot_token_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "trusted_default_kyma-bot-github-sap-token"
    }

  # module.github_webhook_gateway.google_secret_manager_secret_iam_member.webhook_token_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "webhook_token_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "sap-tools-github-backlog-webhook-secret"
    }

Plan: 2 to add, 2 to change, 1 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":8622,"Program":"tfcmt","SHA1":"b20a7f4758b198a26fe9b128ec65fe2e07a6fd68","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->